[
  {
    "id": 1,
    "title": "Defining HR Roles and Responsibilities: Nurturing Organizational Excellence",
    "main":"",
    "image": "images/OurTeam/Sonal.png",
    "content": [
      {
        "type": "header",
        "text": "Introduction"
      },
      {
        "type": "paragraph",
        "text": "An HR department is an essential component of any business, regardless of an organization’s size. It is tasked with maximizing employee productivity and protecting the company from any issues that may arise within the workforce.  The human resource department's mission is to make sure the company's employees are adequately managed, appropriately compensated, and effectively trained. "
      },
      {
        "type": "paragraph",
        "text": "In simplest terms the HR (Human Resources) department is a group who is responsible for managing the employee life cycle (i.e., recruiting, hiring, on-boarding, training, and firing employees) and administering employee benefits.  "
      },
      {
        "type": "image3",
        "text": "/images/vlog/hr/1.png"
      },
      {
        "type": "header",
        "text": "What is the role and scope of the human resource department?"
      },
      {
        "type": "paragraph",
        "text": "The human resource department provides effective policies, procedures, and people-friendly guidelines and support. Additionally, the human resource function serves to make sure that the company's mission, vision, and values are part of the company culture."
      },
      {
        "type": "image2",
        "text": "/images/vlog/hr/2.jpg"
      },
      {
        "type": "header",
        "text": "Here are some of the tasks the HR department is busy completing every day:"
      },
      {
        "type": "header",
        "text": "1.Recruit candidates"
      },
      {
        "type": "paragraph",
        "text": "HR needs to understand the organization’s needs and make sure those needs are met when recruiting for new positions. It’s not as simple as just throwing an ad up on Indeed: you’ll need to analyse the market, consult stakeholders, and manage budgets. Then, once the role is advertised, more research needs to be done to make sure that the right candidates are being attracted and presented. Recruiting is a massive—and costly—undertaking; the right candidate can revitalize an entire organization, but the wrong candidate can upend operations."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/3.jpg"
      },
      {
        "type": "header",
        "text": "2.Hire the right employees"
      },
      {
        "type": "paragraph",
        "text": "Human resources are in charge of arranging interviews, coordinating hiring efforts, and on boarding new employees. They’re also in charge of making sure all paperwork involved with hiring someone is filled out and making sure that everything from the first day to each subsequent day is navigated successfully."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/4.png"
      },
      {
        "type": "header",
        "text": "3.Process payroll"
      },
      {
        "type": "paragraph",
        "text": "Payroll is its own beast. Every payday must have taxes calculated and hours collected. Expenses need to be reimbursed and raises and bonuses need to be added in as well. If you think it’s a chore doing taxes just once a year, imagine what it must be like to be in HR and make sure they’re properly deducted every pay period. "
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/5.jpg"
      },
      {
        "type": "header",
        "text": "4.Conduct disciplinary actions"
      },
      {
        "type": "paragraph",
        "text": "This responsibility may be why HR tends to get a bad rap. When navigated inappropriately, disciplinary actions can lead to the loss of a valuable employee and can even result in litigation or a poor reputation. But when handled appropriately, disciplinary action can result in the success of an employee."
      },
      {
        "type": "paragraph",
        "text": "For instance, if a company notices that a particular employee is routinely late and continues being late even after the employee has received several warnings, HR could step in and investigate the reason for the tardiness. It may be an opportunity to extend benefits such as counselling to the employee or offer additional resources to help the employee learn to be on time. Instead of taking on the cost of firing and then recruiting a replacement for that employee, it could be a learning opportunity that could enhance that employee’s career."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/6.png"
      },
      {
        "type": "header",
        "text": "5.Update policies"
      },
      {
        "type": "paragraph",
        "text": "Policies need to be updated (or at least examined) every year as the organization changes. It’s HR’s job to make official updates to policies and to suggest changes to policies when they no longer serve the company or the employees. Sometimes a policy should be updated as a reaction to an occurrence. HR should always be included in and consulted with regarding these decisions."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/7.png"
      },
      {
        "type": "header",
        "text": "6.Maintain employee records"
      },
      {
        "type": "paragraph",
        "text": "Maintaining HR records is mandated by law. These records help employers identify skill gaps to help with the hiring process and to analyse demographic data and comply with regulations. They also contain personal details and emergency contacts for each employee. "
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/8.png"
      },
      {
        "type": "header",
        "text": "7.Conduct benefit analysis"
      },
      {
        "type": "paragraph",
        "text": "Staying competitive is of prime importance when trying to attract the best talent. A promising recruit may choose a different companywith lesser pay if the benefits are more attractive. HR should routinely investigate similar companies to see if their benefits are competitive."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/9.png"
      },
      {
        "type": "header",
        "text": "8.Development"
      },
      {
        "type": "paragraph",
        "text": "The human resource department also is in charge of employee development, which may involve training but which may also focus on succession planning and career development. Preparing certain employees for promotions and advanced roles is part of the responsibility of a human resource department."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/10.png"
      },
      {
        "type": "header",
        "text": "9.Firing"
      },
      {
        "type": "paragraph",
        "text": "Finally, on the occasions when an employee just doesn't work out, the human resource department is responsible for managing firings. As part of this, they may conduct exit interviews and arrange for the employee's last pay check to be delivered."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/11.png"
      },
      {
        "type": "header",
        "text": "How Does HR Department Support Employees?"
      },
      {
        "type": "paragraph",
        "text": "Besides the examples above, which are mostly operational responsibilities, HR provides less quantitative functions: It exists to help employees thrive."
      },
      {
        "type": "paragraph",
        "text":"After all, employees are the single biggest asset to any organization. It follows, then, that protecting their well-being is of utmost importance. "
      },
      {
        "type": "image3",
        "text": "/images/vlog/hr/12.png"
      },
      {
        "type": "header",
        "text": "Here are four ways HR helps support the emotional and career needs of employees:"
      },
      {
        "type": "header",
        "text": "1.Providing career growth"
      },
      {
        "type": "paragraph",
        "text": "Stagnation is bad for business, and it’s smart to keep your best employees with the company. HR can provide career paths to help guide each employee to a long future within the company. HR can then check in periodically to further guide employees on their career paths."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/13.jpg"
      },
      {
        "type": "header",
        "text": "2.Offering continuing education"
      },
      {
        "type": "paragraph",
        "text": "Sometimes the career growth mentioned above requires additional training. Your organization may provide educational assistance, and HR can help determine which classes and training programs would be best for an employee on his or her designated career path. HR can also work with managers to ensure that the employee’s work schedule is flexible enough to allow the employee to attend classes."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/14.jpg"
      },
      {
        "type": "header",
        "text": "3.Training and supporting managers"
      },
      {
        "type": "paragraph",
        "text": "Managers aren’t born. They’re created. HR can help provide management guidance to managers, making sure that department and teams are as healthy and functional as possible. This may include periodically sending managers to formal trainings and retreats."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/15.png"
      },
      {
        "type": "header",
        "text": "4.Supporting health and wellness"
      },
      {
        "type": "paragraph",
        "text": "It’s important to remember that employees are people. They’ll need help weathering mental illness, health issues, debt, pregnancies, adoption, and myriad other life occurrences. HR can help support employees through any of these and other circumstances."
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/16.png"
      },
      {
        "type": "header",
        "text": "When to contact human resource?"
      },
      {
        "type": "paragraph",
        "text": "An HR department that never interacts with employees isn’t doing its job. While you’re developing an on boarding procedure, educate new employees on when to reach out to HR and what resources HR has to offer. The HR department should regularly schedule one-on-one interviews with employees to check in on their career progression, comfort in their roles, and any other issues the employee may be having. "
      },
      {
        "type": "header",
        "text": "Considering these responsibilities, employees should feel comfortable reaching out to their HR departments in these, and similar, situations:"
      },
      {
        "type": "paragraph",
        "text": "1.When you (or a co-worker) experience harassment or discrimination from your colleagues, including your manager"
      },
      {
        "type": "paragraph",
        "text": "2.When you have questions about benefits, including company-provided health insurance or rights guaranteed by law"
      },
      {
        "type": "paragraph",
        "text": "3.When your personal circumstances change (e.g. having a child, needing to reduce your hours, needing accommodation for a disability)"
      },
      {
        "type": "paragraph",
        "text": "4.When you have questions about advancing at the company, including opportunities to shadow other employees or participate in additional training"
      },
      {
        "type": "paragraph",
        "text": "5.When you need an objective third-party to work through a work-related issue"
      },
      {
        "type": "image1",
        "text": "/images/vlog/hr/17.png"
      },
      {
        "type": "header",
        "text": "Conclusion"
      },
      {
        "type": "paragraph",
        "text":"In conclusion, human resources play a pivotal role in the success and sustainability of any organization. From recruitment and talent management to employee engagement and development, HR professionals are the backbone of a thriving workforce. Throughout this blog, we've explored the multifaceted responsibilities of HR, including the critical tasks of maintaining compliance, fostering a positive workplace culture, and ensuring a diverse and inclusive environment"   
      },
      {
        "type": "paragraph",
        "text":"As we look to the future, the field of human resources is poised for continued evolution, driven by technological advancements, changing workforce dynamics, and the ongoing pursuit of excellence in talent management. With the growing recognition of HR as a strategic partner, organizations are increasingly investing in their human resources departments to harness the full potential of their workforce."   
      },
      {
        "type": "paragraph",
        "text":"In a world where people are at the heart of every business, human resources is the compassthat guides the way forward, steering companies toward prosperity, innovation, and a brighter future for all."   
      },
      {
        "type": "image2",
        "text": "/images/vlog/hr/18.png"
      }
    ],    
"footer":[
  {
    "type":"email",
    "text":"hr@i2s.in"
  },  {
    "type":"name",
    "text":"Sonal Singh"
  }
  ,  {
    "type":"contact",
    "text":"7209383718"
  }
  ,  {
    "type":"picture",
    "text":"/images/OurTeam/Sonal.png"
  }
]
  
  },
  {
    "id": 2,
    "title": "Who is a graphics designer?",
    "main":"",
    "image": "images/OurTeam/Prakash.png",
    "content": [
      {
        "type": "header",
        "text": "Introduction"
      },
      {
        "type": "paragraph",
        "text": "A graphic designer is a visual communicator who uses images, fonts, and colors to communicate ideas and emotions through images, typography, and color. Working with a variety of projects, from logos and websites to packaging and advertising. Graphic designers use their creativity and technical skills to create designs that are both visually appealing and effective at communicating the intended message. Graphic designers are in high demand in today's economy, as businesses increasingly rely on visual communication to reach their target audiences. If you have a creative flair and a passion for design, a career in graphic design could be a great fit for you."
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/1.jpg"
      },
      {
        "type": "header",
        "text":"History"
      },
      {
        "type": "paragraph",
        "text": "The history of graphic design can be traced back to the earliest forms of human communication, such as cave paintings and hieroglyphs. However, the modern profession of graphic design began to emerge in the late 19th century, with the invention of movable type printing. This made it possible for designers to create and reproduce complex designs in large quantities. "
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/2.jpg"
      },
      {
        "type":"paragraph",
        "text":"In the early 20th century, graphic design began to be used more and more in advertising and marketing. Businesses realized that they could use well-designed visuals to attract customers and promote their products. As a result, graphic designers began to be in high demand."
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/3.jpg"
      },
      {
        "type":"header",
        "text":"Role of Graphics Designer!"
      },
      {
        "type":"paragraph",
        "text":"Graphics designers play a vital role in our society. They help businesses to create a strong brand identity, sell their products, and communicate with their customers. They also help to make our lives more visually appealing and informative by designing the visuals that we see everywhere."
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/4.jpg"
      },
      {
        "type":"header",
        "text":"How graphic design is used today:"
      },
      {
        "type":"paragraph",
        "text":"1.Logos and branding: Graphic designers create logos and branding materials that help businesses to establish their identity and stand out from the competition."
      },
      {
        "type":"paragraph",
        "text":"2.Packaging design: Graphic designers create packaging designs that are both visually appealing and functional."
      },
      {
        "type":"paragraph",
        "text":"3.Website and app design: Graphic designers create websites and apps that are both easy to use and visually appealing."
      },
      {
        "type":"paragraph",
        "text":"4.Editorial design: Graphic designers design magazines, newspapers, and books. They work with editors and writers to create layouts that are both informative and visually appealing."
      },
      {
        "type":"paragraph",
        "text":"5.Advertising and marketing materials: Graphic designers create advertising and marketing materials such as brochures, posters, and flyers. They use their skills to create visuals that will capture people's attention and persuade them to buy a product or service."
      },
      {
        "type":"paragraph",
        "text":"6.Signage and billboards: Graphic designers create signage and billboards that communicate information to the public. They use their skills to create visuals that are clear, concise, and visually appealing."
      },
      {
        "type":"paragraph",
        "text":"7.Illustrations and info graphics: Graphic designers create illustrations and info graphics to communicate information in a visually appealing way. Illustrations are often used in books, magazines, and websites. Info graphics are often used on websites and social media to present complex information in a simple and easy-to-understand way."
      },
      {
        "type":"image2",
        "text":"/images/vlog/graphic/5.jpg"
      },
      {
        "type":"header",
        "text":"Skills required for a graphic designer:"
      },
      {
        "type":"paragraph",
        "text":"1.Creativity"
      },
      {
        "type":"paragraph",
        "text":"2.Strong problem-solving skills"
      },
      {
        "type":"paragraph",
        "text":"3.Ability to think visually"
      },
      {
        "type":"paragraph",
        "text":"4.Excellent communication skills"
      },
      {
        "type":"paragraph",
        "text":"5.Proficiency in design software, such as Adobe Photoshop, Illustrator, and InDesign"
      },
      {
        "type":"paragraph",
        "text":"6.Understanding of typography, color theory, and design principles"
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/6.jpg"
      },
      {
        "type":"header",
        "text":"What makes a great graphic designer?"
      },
      {
        "type":"paragraph",
        "text":"1. Creative and original: Graphic designers need to be able to come up with new and innovative ideas for their designs."
      },
      {
        "type":"paragraph",
        "text":"2. Technically proficient: Graphic designers need to be skilled in using design software such as Adobe Photoshop, Illustrator, and InDesign."
      },
      {
        "type":"paragraph",
        "text":"3. Have a strong understanding of design principles: Graphic designers need to understand the principles of design, such as color theory, typography, and layout, in order to create effective visuals."
      },
      {
        "type":"paragraph",
        "text":"4. Are able to communicate effectively: Graphic designers need to be able to communicate their ideas clearly and effectively to clients and other team members."
      },
      {
        "type":"paragraph",
        "text":"5. Are able to meet deadlines: Graphic designers often work on tight deadlines, so it is important for them to be able to manage their time effectively and meet their commitments"
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/7.jpg"
      },
      {
        "type":"header",
        "text":"How to become a graphic designer"
      },
      {
        "type":"paragraph",
        "text":"There are a few different paths to becoming a graphic designer. Some people choose to get a degree in graphic design from a college or university. Others may start by taking courses or workshops to learn the basics of graphic design. It is also possible to learn graphic design through self-study and by working on personal projects."
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/8.jpg"
      },
      {
        "type":"paragraph",
        "text":"Once you have the necessary skills and experience, you can start looking for graphic design jobs. There are a number of different ways to find graphic design jobs, including online job boards, networking, and contacting design agencies and companies directly."
      },
      {
        "type":"header",
        "text":"Software for graphics designing:"
      },
      {
        "type":"paragraph",
        "text":"1.Adobe Photoshop"
      },
      {
        "type":"paragraph",
        "text":"2. Adobe Illustrator"
      },
      {
        "type":"paragraph",
        "text":"3. Adobe InDesign"
      },
      {
        "type":"paragraph",
        "text":"4. Corel DRAW Graphics Suite"
      },
      {
        "type":"paragraph",
        "text":"5. Affinity Designer"
      },
      {
        "type":"paragraph",
        "text":"6. GIMP"
      },
      {
        "type":"paragraph",
        "text":"7. Gravit Designer"
      },
      {
        "type":"image3",
        "text":"/images/vlog/graphic/9.png"
      },
      {
        "type":"header",
        "text":"Working of graphic designer with AI"
      },
      {
        "type":"paragraph",
        "text":"AI is rapidly changing the way graphic designers work. AI-powered tools can help graphic designers to: "
      },
      {
        "type":"paragraph",
        "text":"1.Automate repetitive tasks: AI can automate many of the repetitive tasks involved in graphic design, such as resizing images, creating color palettes, and generating layouts. This frees up graphic designers to focus on more creative and strategic aspects of their work."
      },
      {
        "type":"paragraph",
        "text":"2.Generate new ideas: AI can generate new design ideas that graphic designers may not have thought of on their own. For example, AI can be used to generate different logo concepts or to create a mood board for a new marketing campaign."
      },
      {
        "type":"paragraph",
        "text":"3. Improve the quality of designs: AI can be used to improve the quality of designs in a number of ways. For example, AI can be used to enhance the quality of images or to identify and correct errors in typography."
      },
      {
        "type":"paragraph",
        "text":"Some of the benefits of graphic designers working with AI is Increased productivity, Improved quality of work, Reduced costs."
      },
      {
        "type":"paragraph",
        "text":"AI is being used by graphic designers today in Logo Designing, Web Designing and Image Editing."
      },
      {
        "type":"image1",
        "text":"/images/vlog/graphic/10.jpg"
      },
      {
        "type":"header",
        "text":"Few examples of the many ways that graphics designers make a difference in our lives:"
      },
      {
        "type":"paragraph",
        "text":"1.The Coca-Cola logo is one of the most recognizable logos in the world. It was designed by Frank Robinson in 1887 and has remained largely unchanged ever since. The logo's simple yet effective design has helped to make Coca-Cola one of the most successful brands in history."
      },
      {
        "type":"paragraph",
        "text":"2.The Apple logo was designed by Rob Janoff in 1977. The logo is a simple, bitten apple that has become synonymous with the Apple brand. The logo's design is both playful and elegant, and it perfectly reflects the Apple brand's commitment to innovation and creativity."
      },
      {
        "type":"paragraph",
        "text":"3.The Nike swoosh was designed by Carolyn Davidson in 1971. The swoosh is a simple, curved line that represents movement and speed. The logo is now one of the most recognizable logos in the world and is used on all of Nike's products."
      },
      {
        "type":"paragraph",
        "text":"4.The Google logo was designed by Ruth Kedar in 1999. The logo is a simple, colorful wordmark that reflects the company's playful and innovative personality. The logo is also designed to be easy to read and remember, which is important for a company that relies heavily on its website and online presence."
      },
      {
        "type":"header",
        "text":"Conclusion"
      },
      {
        "type":"paragraph",
        "text":"Graphics designers are in high demand in a variety of industries. If you have a passion for creativity and design, a career in graphic design may be right for you."
      },
      {
        "type":"image2",
        "text":"/images/vlog/graphic/11.jpg"
      }
    ],    
"footer":[
  {
    "type":"email",
    "text":"prakashchbhakat@gmail.com"
  },  
  {
    "type":"name",
    "text":"Prakash Chandra Bhakat"
  },
  {
    "type":"contact",
    "text":""
  },
  {
    "type":"picture",
    "text":"/images/OurTeam/prakash.png"
  }
]
  
  }
]
